tutorials/Coupled/2D_example_steady_NSnonD/0/cMinus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      cMinus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    bottom
    {
	type            zeroIonicFlux_nonD;
	zib		-1;        
	T		300;
	value           uniform 1;


/*
	type		fixedValue;
	value		uniform 1;

	type            zeroIonicFlux;
	zib		-1;        
	T		300;
	value           uniform 1;

        type            fixedFlux;
	c		cMinus;
	z		-1;
	T		300;
	gradient	uniform 0.0;
	value		calculated; // calculated;
*/  
  }

    top
    {
        type            fixedValue;
        value           uniform 1;
    }

    wall
    {
	type            zeroGradient;
    }  
}


// ************************************************************************* //
